<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads ClickShareLauncher and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.gerardkok.pkg.ClickShareLauncher</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ClickShareLauncher</string>
            <key>PKG_ID</key>
            <string>com.barco.clicksharelauncher</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.gerardkok.download.ClickShareLauncher</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/ClickShare-Extension-Pack-*.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/ClickShare-Extension-Pack.pkg</string>
                    <key>overwrite</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/ClickShare-Extension-Pack.pkg</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/ClickShareLauncherComponent</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/ClickShareLauncherComponent/ClickShareLauncherComponent.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/ClickShare Launcher.app</string>
                    <key>requirement</key>
                    <string>identifier "com.barco.clicksharelauncher" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = P6CDJZR997</string>
                    <key>expected_authority_names</key>
                    <array/>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Applications/ClickShare Launcher.app/Contents/Info.plist</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                        <key>pkgname</key>
                        <string>%NAME%</string>
                        <key>id</key>
                        <string>%PKG_ID%</string>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <string>%RECIPE_CACHE_DIR%/ClickshareLauncherComponent</string>
                        <string>%RECIPE_CACHE_DIR%/ClickShare-Extension-Pack.pkg</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>
</plist>
